package lesson28;

public class CalculationOfTiles {
    public static void main(String[] args) {
//        Мастеру плиточнику Сергею Ивановичу Золотыеруки задают часто один и тот же вопрос. Сколько будет стоить положить плитку на определённом участке.
//
//        Нам известно, что в час он кладёт примерно один квадратный метр плитки.
//
//                Его час стоит 27€ без НДС.
//                Стандартная плитка 30 на 20 сантиметров.
//                Сергей Иванович обратился к нам за помощью и вам надо написать для него программу.
//                Которая будет принимать размеры стены/пола, стоимость плитки и выдавать:
//
//        Количество требуемых плиток, как целых, так и тех которые надо будет резать. Учтите,
//        что плитку можно класть как вдоль, так и поперёк и только на месте мастер узнает, как именно её надо класть.
//
//        Стоимость материала
//        Стоимость рабочего времени
//        Итоговую ориентировочную стоимость

        double aTile=30;//cm
        double bTile=20;//cm


        double a=200;//cm
        double b=400;//cm
        double tilesPrise;

        getCostOfMaterial();
        getCostOfTime();
        getTotalCost();
    }

    public static void getCostOfMaterial() {

    }

    public static void getCostOfTime() {

    }

    public static void getTotalCost() {

    }
}
